---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionData.ExtrusionBasis
source: html/91fac92c-04fc-9b4b-63e3-b816c944c772.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.ExtrusionBasis Property

The basis used for the extrusion.

## Syntax (C#)
```csharp
public IFCExtrusionBasis ExtrusionBasis { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration